Sources/interTwoPhaseCentralFoam/tutorial/blastToCyl/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       29650;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       29700;
    }
    wallUpper
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       29750;
    }
    wallSymmetricBorder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       30050;
    }
    symwall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          30000;
        startFace       30350;
    }
)

// ************************************************************************* //
