Sources/interTwoPhaseCentralFoam/tutorial/blastToCyl/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (-1 0.5 0)
    ( 2 0.5 0)
    ( 2 1 0)
    (-1 1 0)
    (-1 0.5 0.1)
    ( 2 0.5 0.1)
    ( 2 1 0.1)
    (-1 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (300 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    wallUpper
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }
    wallSymmetricBorder
    {
        type wall;
        faces
        (
            (0 1 4 5)
        );
    }
    symwall
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
