Sources/interTwoPhaseCentralFoam/tutorial/blastToCyl/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     Veronika;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3e-5;

deltaT          1e-8;

writeControl    adjustable;

writeInterval   5e-6;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false;

//w/o DTS
maxCo        0.25; //0.25, 0.5, 0.75, 1.25, 2.5


// ************************************************************************* //
